src/InformationRegisters/УровниИнцидентовПовторноеОповещение/УровниИнцидентовПовторноеОповещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УровниИнцидентовПовторноеОповещение</name>
  <resources>
    <name>ПериодПовторногоОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/УровниИнцидентов/УровниИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниИнцидентов</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>КритическаяОшибка</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/УровниИнцидентовПовторноеОповещение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиПоУмолчанию() Экспорт
	
	НаборЗаписей = РегистрыСведений.УровниИнцидентовПовторноеОповещение.СоздатьНаборЗаписей();
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.Информация;
	НовЗапись.ПериодПовторногоОповещения = 7200;
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.Предупреждение;
	НовЗапись.ПериодПовторногоОповещения = 3600;
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.Ошибка;
	НовЗапись.ПериодПовторногоОповещения = 1800;
	
	НовЗапись = НаборЗаписей.Добавить();
	НовЗапись.УровеньИнцидента = Перечисления.УровниИнцидентов.КритическаяОшибка;
	НовЗапись.ПериодПовторногоОповещения = 600;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
